In [5]:
import pandas as pd
import Utilidades as ut

In [6]:
df = pd.read_csv('../Datos/Archivos csv/florida.csv')
df.head(3)

,user_id,name,time,rating,text,pics,resp,gmap_id
0,1.014719e+20,Julie A. Gerber,1628003250740,1,Update: Their “reply” to my review amounted to...,NaN,{'text': 'Thank you for the feedback. We would...,0x8893863ea87bd5dd:0x9383ebf973e74abb
1,1.154772e+20,Martin Sheffield,1595031217005,5,He's a knowledgeable doctor but the way he run...,NaN,{'text': 'Thank you for reaching out. I’m forw...,0x8893863ea87bd5dd:0x9383ebf973e74abb
2,1.018050e+20,Brian Truett,1522924253567,5,"Best doctor I've ever had, I never wait to be ...",NaN,NaN,0x8893863ea87bd5dd:0x9383ebf973e74abb

Verificamos tipos de datos de las columnas y los nulos

In [9]:
ut.tipo_dato(df)

   columna                         tipo_dato  porcentaje_nulos
0  user_id                 [<class 'float'>]              0.00
1     name  [<class 'str'>, <class 'float'>]              0.00
2     time                   [<class 'int'>]              0.00
3   rating                   [<class 'int'>]              0.00
4     text  [<class 'str'>, <class 'float'>]             37.88
5     pics  [<class 'float'>, <class 'str'>]             96.34
6     resp  [<class 'str'>, <class 'float'>]             84.02
7  gmap_id                   [<class 'str'>]              0.00

Cambimos el tipo de dato de la columna 'name'

In [10]:
df['name'] = df['name'].astype(str)

Cambiamos el tipo de dato de la columna 'time'

In [11]:
# convierte a formato de fecha y hora
df['time'] = pd.to_datetime(df['time'])

Reemplazamos nulos en la columna 'text'

In [12]:
# Cambiamos nulos por 'Sin dato'
df['text'] = df['text'].fillna('Sin datos')

Eliminamos las columnas 'resp' y 'pics' debido al gran porcentaje de nulos y contenido de datos irrelevantes para nuestro objetivo

In [13]:
columnas = ['pics', 'resp']
df = df.drop(columnas, axis=1)

In [14]:
df.head()

,user_id,name,time,rating,text,gmap_id
0,1.014719e+20,Julie A. Gerber,1970-01-01 00:27:08.003250740,1,Update: Their “reply” to my review amounted to...,0x8893863ea87bd5dd:0x9383ebf973e74abb
1,1.154772e+20,Martin Sheffield,1970-01-01 00:26:35.031217005,5,He's a knowledgeable doctor but the way he run...,0x8893863ea87bd5dd:0x9383ebf973e74abb
2,1.018050e+20,Brian Truett,1970-01-01 00:25:22.924253567,5,"Best doctor I've ever had, I never wait to be ...",0x8893863ea87bd5dd:0x9383ebf973e74abb
3,1.063444e+20,Tina Sun,1970-01-01 00:24:27.907819586,1,I was told he is a good doctor. I was trying t...,0x8893863ea87bd5dd:0x9383ebf973e74abb
4,1.008751e+20,James Haynes,1970-01-01 00:24:40.683415081,5,Takes the time to actually get to know his pat...,0x8893863ea87bd5dd:0x9383ebf973e74abb

Verificamos los tipos de datos y nulos nuevamente

In [15]:
ut.tipo_dato(df)

,columna,tipo_dato,porcentaje_nulos
0,user_id,[<class 'float'>],0.0
1,name,[<class 'str'>],0.0
2,time,[<class 'pandas._libs.tslibs.timestamps.Timest...,0.0
3,rating,[<class 'int'>],0.0
4,text,[<class 'str'>],0.0
5,gmap_id,[<class 'str'>],0.0